app/Models/modelLibros.php

SELECT `tbl_libros`.*, `tbl_tema`.`tem_tema`, `tbl_librostema`.*
FROM `tbl_libros`
JOIN `tbl_librostema` ON `tbl_librostema`.`lib_id` = `tbl_libros`.`lib_id`
JOIN `tbl_tema` ON `tbl_tema`.`tem_id` = `tbl_librostema`.`tem_id`
SELECT `lib`.`lib_id`, `lib`.`lib_titulo`, `lib`.`lib_codigo`, `lib`.`lib_precio`, `lib`.`lib_resumen`, `lib`.`lib_estado`, `tem`.`tem_id`, `tem`.`tem_tema`
FROM `tbl_librostema` `lit`
JOIN `tbl_libros` `lib` ON `lit`.`lib_id` = `lib`.`lib_id`
JOIN `tbl_tema` `tem` ON `tem`.`tem_id` = `lit`.`tem_id`
---
    public function ListarLibros()
    {
        $valor = $this->db->table('tbl_librostema lit'); //tabla intermedia
        $valor->select('lib.lib_id, lib.lib_titulo, lib.lib_codigo, lib.lib_precio, lib.lib_resumen, lib.lib_estado, tem.tem_id, tem.tem_tema'); //selecciono todos los campos de todas las tablas que quiero
        $valor->join('tbl_libros lib', 'lit.lib_id = lib.lib_id'); //join con la tabla estudiantes
        $valor->join('tbl_tema tem', 'tem.tem_id = lit.tem_id'); //join con la tabla libros
        $query = $valor->get(); //ejecutas

SELECT `tem_id`, `tem_tema`
FROM `tbl_tema`
---
    public function ListarTemas()
    {
        $valor = $this->db->table("tbl_tema");
        $valor->select('tem_id, tem_tema');
        $query = $valor->get(); //ejecutas

SELECT `tbl_libros`.*, `tbl_tema`.`tem_tema`
FROM `tbl_libros`
JOIN `tbl_librostema` ON `tbl_librostema`.`lib_id` = `tbl_libros`.`lib_id`
JOIN `tbl_tema` ON `tbl_tema`.`tem_id` = `tbl_librostema`.`tem_id`
WHERE `tbl_libros`.`lib_codigo` = '50520'
 LIMIT 1
---
    public function BuscarLibros($codigo)
    {
        return $this->select('tbl_libros.*, tbl_tema.tem_tema')
            ->where('tbl_libros.lib_codigo', $codigo)
            ->join('tbl_librostema', 'tbl_librostema.lib_id = tbl_libros.lib_id')
            ->join('tbl_tema', 'tbl_tema.tem_id = tbl_librostema.tem_id')
            ->first();

SELECT `lib`.`lib_id`, `lib`.`lib_titulo`, `lib`.`lib_codigo`, `lib`.`lib_precio`, `lib`.`lib_resumen`, `lib`.`lib_estado`, `tem`.`tem_id`, `tem`.`tem_tema`
FROM `tbl_librostema` `lit`
JOIN `tbl_libros` `lib` ON `lit`.`lib_id` = `lib`.`lib_id`
JOIN `tbl_tema` `tem` ON `tem`.`tem_id` = `lit`.`tem_id`
WHERE `tem`.`tem_id` IS NULL
---
    public function verLibrosXTema($temaID)
    {
        $valor = $this->db->table('tbl_librostema lit'); //tabla intermedia
        $valor->select('lib.lib_id, lib.lib_titulo, lib.lib_codigo, lib.lib_precio, lib.lib_resumen, lib.lib_estado, tem.tem_id, tem.tem_tema');
        $valor->join('tbl_libros lib', 'lit.lib_id = lib.lib_id');
        $valor->join('tbl_tema tem', 'tem.tem_id = lit.tem_id');
        $valor->where('tem.tem_id', $temaID); // Filtrar por el tema seleccionado
        $query = $valor->get();